# Essential taps
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"

# Core development tools
brew "bat"                    # Better cat with syntax highlighting
brew "eza"                    # Better ls with colors and icons
brew "fzf"                    # Fuzzy finder - essential for workflow
brew "ripgrep"                # Fast grep alternative
brew "tree"                   # Directory tree visualization
brew "tmux"                   # Terminal multiplexer
brew "neovim"                 # Your primary editor
brew "zoxide"                 # Smart cd replacement
brew "stow"                   # GNU Stow for dotfiles management 

# Git tools
brew "jesseduffield/lazygit/lazygit"  # Git TUI

# Programming languages & runtimes
brew "node"                   # JavaScript/TypeScript runtime
brew "python@3.12"           # Python development
brew "pyenv"                  # Python version management
cask "miniforge"              # Conda package manager 
brew "openjdk"                # Java development
brew "gcc"                    # C++ compilation
brew "go" 

# Build tools & package managers
brew "maven"                  # Java build tool
brew "cocoapods"              # iOS dependency manager

# Development utilities
brew "clang-format"           # C++ code formatting
brew "glow"                   # Markdown viewer
brew "firebase-cli"           # Firebase development

# Window management (since you use these)
brew "koekeishiya/formulae/skhd"    # Hotkey daemon
brew "koekeishiya/formulae/yabai"   # Tiling window manager

# Essential GUI applications
cask "ghostty"                # Your terminal
cask "obsidian"              # Note-taking
cask "hammerspoon"           # macOS automation

# Daily driver apps (add these)
cask "brave-browser"         # Your browser
cask "spotify"               # Music
cask "ticktick"              # Task management
cask "visual-studio-code"    # Your IDE

# Development tools 
cask "flutter" # Flutter SDK 

# Core VS Code extensions
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "golang.go"
vscode "redhat.java"
vscode "vscjava.vscode-java-pack"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
vscode "eamodio.gitlens"
vscode "pkief.material-icon-theme"
vscode "catppuccin.catppuccin-vsc"
vscode "vscodevim.vim"
vscode "formulahendry.code-runner"
vscode "gruntfuggly.todo-tree"
vscode "xaver.clang-format"
vscode "ms-toolsai.jupyter"
vscode "james-yu.latex-workshop"